# DocumentSaveToLocalProgressChangedEventArgs Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DocumentSaveToLocalProgressChangedEventArgs Properties
DocumentSaveToLocalProgressChangedEventArgs Class See Also
---
The DocumentSaveToLocalProgressChangedEventArgs type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| BeforeSaveToCentral | True if the "save to local" operation is occurring before "save to central"; false if after. |
| Cancellable | Indicates whether an event may be cancelled by an event delegate.  (Inherited from RevitAPIEventArgs.) |
| FinishedStreams | The number of streams finished since the last time this event was raised. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from RevitAPIEventArgs.) |
| Location | Full path of the central model which is to be operated.  (Inherited from WorksharedOperationProgressChangedEventArgs.) |
| SaveToLocalFinished | Indicates if the current "save to local" operation has finished. |
| Status | Gets API event status, reflect current operation execution status.  (Inherited from WorksharedOperationProgressChangedEventArgs.) |
| TotalStreams | The total expected number of streams to save to local. |

# See Also
DocumentSaveToLocalProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace